Catalogs/ОбъектыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ОбъектыЛицевыхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подъезды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суффикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКомнат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖилойФонд</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЖилойНеЖилойФонд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паркинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЖилойНеЖилойФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЖилойНеЖилойФонд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жилой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЖилой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСооружений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСооружений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паркинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общежитие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаЗданий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОбъектыЛицевыхСчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура устанавливает видимость и доступность элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Если Объект.ЖилойФонд = Перечисления.ЖилойНеЖилойФонд.НеЖилой Тогда
		
//{{MRG[ <-> ]
//		Элементы.Магазин.Видимость = Истина;
//}}MRG[ <-> ]
		Элементы.Паркинг.Видимость = Истина;
		Элементы.Префикс.Видимость = Истина;
		
		Если Объект.Паркинг Тогда
			Элементы.Код.Видимость = Ложь;
			Элементы.КоличествоКомнат.Видимость = Ложь;
			Элементы.Подъезд.Видимость = Ложь;
			Элементы.Суффикс.Заголовок = "Машиноместо";
			Элементы.Префикс.Видимость = Ложь;
			
		Иначе
			Элементы.Код.Видимость = Истина;
			Элементы.КоличествоКомнат.Видимость = Истина;
			Элементы.Подъезд.Видимость = Истина;
			Элементы.Суффикс.Заголовок = "Суффикс";
		КонецЕсли; 
		
	Иначе
//{{MRG[ <-> ]
//		Элементы.Магазин.Видимость = Ложь;
//}}MRG[ <-> ]
		Элементы.Паркинг.Видимость = Ложь;
		Элементы.Префикс.Видимость = Ложь;
		Элементы.Код.Видимость = Истина;
		Элементы.КоличествоКомнат.Видимость = Истина;
		Элементы.Подъезд.Видимость = Истина;
		Элементы.Суффикс.Заголовок = "Суффикс";
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Дерево = РеквизитФормыВЗначение("ВидыПлощадей");
	Для каждого СтрокаВидыПлощадей Из Дерево.Строки Цикл
		
		СтруктураОтбора = Новый Структура("Помещение, ВидПлощади", ТекущийОбъект.Ссылка, СтрокаВидыПлощадей.ВидПлощади);
		СтруктураСведений = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.ПолучитьПоследнее(ДатаИзменения, СтруктураОтбора);
		ЗначениеСтарое = СтруктураСведений.Площадь;
		
		Если (СтрокаВидыПлощадей.Площадь <> ЗначениеСтарое И (ЗначениеЗаполнено(СтрокаВидыПлощадей.Площадь) ИЛИ ЗначениеСтарое <> Неопределено)) Тогда
			//Значение площади изменилось
			ЗаписьРегСведений = РегистрыСведений.ПлощадьОбъектовЛицевыхСчетов.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Помещение  = ТекущийОбъект.Ссылка;
			ЗаписьРегСведений.ВидПлощади = СтрокаВидыПлощадей.ВидПлощади;
			ЗаписьРегСведений.Площадь    = СтрокаВидыПлощадей.Площадь;
			ЗаписьРегСведений.Период      = ДатаИзменения;
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
			КонецПопытки;
			
		КонецЕсли;	
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			Объект.Наименование = "";
			Объект.Код = 0;
			ЗаполнитьПлощадь(Параметры.ЗначениеКопирования);
			
		Иначе
			
			ЗаполнитьПлощадь(Справочники.ОбъектыЛицевыхСчетов.ПустаяСсылка());
			
		КонецЕсли;
		
		Если Параметры.ЗначенияЗаполнения.Свойство("Здание") Тогда
			Объект.Владелец = Параметры.ЗначенияЗаполнения.Здание;
		КонецЕсли;
		ДатаИзменения = Объект.Владелец.ДатаВводаВЭксплуатацию;
		
	Иначе
		
		ЗаполнитьПлощадь(Объект.Ссылка);
		ДатаИзменения = ТекущаяДата();
		
	КонецЕсли;
	
	УстановитьВидимостьИДоступность();	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "СтраницаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВариантКоттеджныйПоселок") Тогда
		
		Элементы.Владелец.Заголовок = НСтр("ru='Коттеджный поселок';uk='Котеджне селище'");
		Элементы.Код.Заголовок = НСтр("ru='№ коттеджа';uk='№ котеджа'");
		Элементы.Подъезд.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
		
		Элементы.Этаж.Видимость = Ложь;
		
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьВариантГород") И Объект.Владелец.ТипСооружения = Перечисления.ТипыСооружений.ГруппаЗданий Тогда
		
		Элементы.Владелец.Заголовок = НСтр("ru='Группа коттеджей';uk='Група котеджів'");
		Элементы.Код.Заголовок = НСтр("ru='№ коттеджа';uk='№ котеджа'");
		Элементы.Подъезд.Заголовок = НСтр("ru='Улица';uk='Вулиця'");
		
		Элементы.Этаж.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадь(Помещение)
	
    Дерево = РеквизитФормыВЗначение("ВидыПлощадей");
	Дерево.Строки.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыПлощадей.Ссылка КАК ВидПлощади,
		|	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
		|ИЗ
		|	Справочник.ВидыПлощадей КАК ВидыПлощадей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(, Помещение = &Помещение) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
		|		ПО ВидыПлощадей.Ссылка = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади
		|ГДЕ
		|	ВидыПлощадей.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("Помещение", Помещение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаУровень = Дерево.Строки.Добавить();
		СтрокаУровень.ВидПлощади = Выборка.ВидПлощади;
		СтрокаУровень.Площадь = Выборка.Площадь;
		
	КонецЦикла;	
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ВидыПлощадей");
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидыПлощадейПлощадьПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖилойФондПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ПаркингПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры
